## Production: website
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                   |
|--------|------------------------------------------|
| add    | `aws_amplify_domain_association.gcds_fr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_amplify_domain_association.gcds_fr will be created
  + resource "aws_amplify_domain_association" "gcds_fr" {
      + app_id                              = "d35vdwuoev573o"
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "systeme-design.canada.ca"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_fr"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_fr"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
